In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt   # Diagram / plots
import seaborn as sns

In [3]:
path="Visadataset - Visadataset.csv"
visa_df = pd.read_csv(path)
visa_df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

**Standerdization**

- Standardization means scaling the data into one scale

- We have different columns has different units so that the value will vary

- One column has very huge values

- Another column has very less values

- So it is important to scale all type of units under one scale

- We have 2 procedures

- Standrdization

  - Z-score:<img data-ils="4" jsaction="rcuQ6b:trigger.M8vzZb;" class="rg_i Q4LuWd" jsname="Q4LuWd" width="279" height="130" alt="Z SCORE TABLE - Z Table and Z score calculation" src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSFcFJcHQaPeZINjQrqNZwVU4H1GqO58QP9Xg&amp;usqp=CAU">
  
      
      - the values ranges from -3 to 3
      
- Normalization

  - Min max scalar:<img src="https://i.stack.imgur.com/EuitP.png" jsaction="VQAsE" class="sFlh5c pT0Scc iPVvYb" style="max-width: 1058px; height: 104px; margin: 21px 0px; width: 465px;" alt="python - Can someone explain to me how MinMaxScaler() works? - Stack  Overflow" jsname="kn3ccd" aria-hidden="false">
  
- Values ranges from 0 to 1

In [ ]:
# step-1:Take the prevalaing wage column
# Z-score = x-mean/sigma
# Step-2: Calculate mean of prevailing wage
# step-3: Calculate std of prewage
# Step-4: Nr: Pwage-mean
# Step-5: pwage_zscore=Nr/Dr

In [5]:
pwage=visa_df['prevailing_wage']
pwage_mean=visa_df['prevailing_wage'].mean()
pwage_std=visa=visa_df['prevailing_wage'].std()
Nr=pwage-pwage_mean
visa_df['prevailing_wage_z']=Nr/pwage_std

In [6]:
visa_df[['prevailing_wage','prevailing_wage_z']]

       prevailing_wage  prevailing_wage_z
0             592.2029          -1.398510
1           83425.6500           0.169832
2          122996.8600           0.919060
3           83434.0300           0.169991
4          149907.3900           1.428576
...                ...                ...
25475       77092.5700           0.049923
25476      279174.7900           3.876083
25477      146298.8500           1.360253
25478       86154.7700           0.221504
25479       70876.9100          -0.067762

[25480 rows x 2 columns]

In [7]:
visa_df['prevailing_wage'].max(),visa_df['prevailing_wage_z'].max()

(319210.27, 4.634101837909902)

In [8]:
visa_df['prevailing_wage'].idxmax()

21077

In [9]:
visa_df['prevailing_wage_z'].idxmax()

21077

In [10]:
visa_df['prevailing_wage'].min(),visa_df['prevailing_wage_z'].min()

(2.1367, -1.4096818992891214)

In [12]:
visa_df['prevailing_wage'].idxmin()

20575

In [13]:
# 21077 is max value id
# 20575 is min value id
# can you get only these two rows values
visa_df.iloc[[21077,20575]]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status,prevailing_wage_z
21077,EZYV21078,Asia,High School,N,N,442,2006,Midwest,319210.2700,Year,Y,Denied,4.634102
20575,EZYV20576,North America,Master's,N,N,1552,2004,Northeast,2.1367,Hour,Y,Certified,-1.409682

In [14]:
cols=['prevailing_wage','prevailing_wage_z']
ids=[2107,20575]
visa_df[['prevailing_wage','prevailing_wage_z']].iloc[[2107,20575]]
visa_df[cols].iloc[ids]

       prevailing_wage  prevailing_wage_z
2107        56741.4400          -0.335398
20575           2.1367          -1.409682

# **Session-9**

In [4]:
import pandas as pd
import numpy as np

In [5]:
dict1={'Names':['Ramesh','Suresh','Mahesh',np.nan],
      'Age':[31,32,np.nan,33],
      'City':['Hyd',np.nan,'Mumbai','Chennai']}

In [6]:
data1=pd.DataFrame(dict1)
data1

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      NaN
2  Mahesh   NaN   Mumbai
3     NaN  33.0  Chennai

In [7]:
data1.isnull()

   Names    Age   City
0  False  False  False
1  False  False   True
2  False   True  False
3   True  False  False

In [8]:
data1.isnull().sum()
# every column has one missing value is there

Names    1
Age      1
City     1
dtype: int64

In [9]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [10]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [11]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [12]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [13]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [14]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'City':['Null','Hyd','Mumbai','Chennai']}
data3=pd.DataFrame(dict3)
data3

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

**Method-1**

>Fill the missung values with random number

DataFrame name=data1

method name.fillna

In [15]:
data1

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      NaN
2  Mahesh   NaN   Mumbai
3     NaN  33.0  Chennai

In [16]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0       40
2  Mahesh  40.0   Mumbai
3      40  33.0  Chennai

**Method-2**

>Fill the missung values with random number on specific column

DataFrame name=data1

method name.fillna

In [17]:
data1

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      NaN
2  Mahesh   NaN   Mumbai
3     NaN  33.0  Chennai

In [18]:
data1['Names'].fillna('Ahmed',inplace=True)
data1

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      NaN
2  Mahesh   NaN   Mumbai
3   Ahmed  33.0  Chennai

**Method-3**

- bfill

- ffill

- pad

- backfill

In [19]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [20]:
data1.fillna(method='backfill')

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [21]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [22]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [23]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

- bfill and backfill both are same

- pad and ffill both are same

**Method-4**

- Mean

- Median

- Mode

In [24]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [25]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [26]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [27]:
age_median=data1['Age'].median()
age_median

32.0

In [28]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [29]:
age_mean=data1['Age'].mean()
age_mean

32.0

**Method-5: KNN imputer**

KNN: K nearest neighbors
    
    
- in the KNN imputer instead of taking mean of all the values

- will choose neighbor data

- will take those mean only

<img src="https://vitalflux.com/wp-content/uploads/2020/12/Euclidean-Distance-formula-2.png" jsaction="VQAsE" class="sFlh5c pT0Scc iPVvYb" style="max-width: 651px; height: 345px; margin: 0px; width: 422px;" alt="Different Types of Distance Measures in Machine Learning - Analytics Yogi" jsname="kn3ccd" aria-hidden="false">

- n_neighbors is parameter can choose by user

- if we dont choose by default it will takes as =5

In [31]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [33]:
import pandas as pd
import numpy as np

In [34]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

**Method_6**

- Based on other column 

- some time all above methods will not provide good justification

- at that time we need to check other columns dependency also

- most of the time will pick a column which have highest correlation